/*
 *     형식)
 *          for()
 *          {
 *          }
 *          for()
 *          {
 *          }
 *          ---------------- 단일
 *          
 *          for() ==> 줄수 
 *          {
 *             for() ==> 출력 
 *             {
 *             }
 *          }
 *          
 *      ****
 *      ****
 *      ****
 *      ****
 *      
 *      
 *      *
 *      **
 *      ***
 *      ****
 *       i    j  
 *      줄수  별표 
 *      1     1
 *      --------
 *      2     2
 *      --------
 *      3     3
 *      --------
 *      4     4
 *      --------  i=j  => j=i
 *      
 *      ****
 *      ***
 *      **
 *      * 
 *      
 *      줄수   별표
 *      1      4
 *      ---------
 *      2      3
 *      ---------
 *      3      2
 *      ---------
 *      4      1
 *      --------- i+j=5  j=5-i  ==> 역순 : +
 *      
 *      1 2 34 
 *      ★☆☆☆ 1
 *      ☆★☆☆ 2
 *      ☆☆★☆ 3
 *      ☆☆☆★ 4
 *      
 *      ☆☆☆★ 1    4  i+j=5 => j=5-i
 *      ☆☆★☆ 2    3
 *      ☆★☆☆ 3    2
 *      ★☆☆☆ 4    1
 */
public class 이중_for_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 알고리즘 / 정보처리 문제 (실기)
        for(int i=1;i<=4;i++)
        {
        	/////////////////////////
        	for(int j=1;j<=4;j++)
        	{
        		if((5-i)==j || i==j)
        		 System.out.print("★");
        		else
        		 System.out.print("☆"); 
        	}
        	//////////////////////////
        	System.out.println();
        }
	}

}
