/*
 *     1. 클래스의 구성요소
 *        ----- 설계 : 데이터 / 기능 / 저장 
 *                                 ---- 객체 : 실제 동작 
 *                                     | 어떤 데이터 이용 => 변수 
 *                                     | 어떤 움직일지 => 메소드
 *        class ClassName{
 *          -----------------
 *            변수 
 *             => 공통으로 사용하는 변수 
 *                | => static (정적변수) => 공유변수 
 *             => 객체마다 사용하는 변수 (따라 저장) 
 *                | => instance변수 
 *          -----------------
 *            생성자 : 변수의 초기화 / 메모리 저장 호출 
 *                   프로그램 시작과 동시에 처리하는 기능 
 *                   => 객체 생성시 한번 호출 
 *                   => 호출시에 반드시 new를 동반 
 *                      new 생성자()
 *                   => 자동로그인 / 서버 연결 / 데이터베이스 연결 
 *                   => 반드시 존재 
 *                      만약에 없는 경우 => 자동으로 생성 
 *                                      ----------
 *                                      디폴트 생성자 => 매개변수가 없는 생성자
 *          -----------------
 *            메소드 
 *              = static 메소드 : 공유하는 기능 
 *              = 인스턴스 메소드 : 객체마다 따라 기능 수행
 *              = 다른 클래스와 연결을 할때 사용 
 *              = 사용은 변수를 활용  
 *          -----------------
 *        }
 *     2. 클래스에서 객체 생성 방법 
 *        1) 생명 주기 
 *           -------
 *           객체 생성 ====== 객체 활용 ====== 객체 소멸 ====== 메모리 해제
 *           class A       a.display()     a=null        System.gc()       
 *           {
 *              void display(){}
 *           }
 *           
 *             |=> 메모리 주소를 저장 => 클래스의 변수 / 객체
 *               
 *           A a=new A();
 *               --- --- 생성자 : 변수의 초기값을 설정 
 *               | 새로운 메모리 생성 => 메모리 주소를 저장 
 *           | = 사용자 정의 데이터형 
 *           
 *           메모리 할당 
 *           
 *           --------------------------------------------
 *             MethodArea : 클래스 정보 (메소드) , static 변수
 *           --------------------------------------------
 *             Stack : 메모리 자체 관리 = 지역변수 , 매개변수 
 *                     {}이 끝나면 자동 메모리 회수 
 *                     => 객체 
 *           --------------------------------------------
 *             Heap : 실제 데이터가 저장 = new사용시 생성 
 *                    => 배열 데이터 / 객체 데이터 
 *                    => 관리 = 개발자 = GC
 *           --------------------------------------------
 *           
 *           class A
 *           {
 *              int a=20; // 0 => heap
 *              void display()
 *              {
 *                 int b=10; => stack : 지역변수 우선 순위
 *                 System.out.println(a+b) 
 *              }
 *           }
 *             
 *     3. 생성자의 역할 
 *     4. 변수 종류 
 *        = 지역변수 
 *        = 정적변수
 *        = 인스턴스 변수 
 *     -----------------------
 *     4-1. 접근지정어 
 *          public / protected / default / private 
 *     4-2. 제어어 
 *          static / final / abstract 
 *     
 *     5. 객체지향의 3대특성
 *        = 캡슐화 : 데이터 보호
 *          => Getter / Setter 
 *             읽기       쓰기  ===> 변수의 기능 
 *          => lombok 
 *        = 상속 : 확장 / 재사용 
 *          => extends 
 *             상속 내리는 클래스 ==> 재사용 
 *             상속 받는 클래스 ==> 확장
 *          => 포함 클래스
 *        = 다형성 : 새로운 기능 추가 / 기존의 기능 변경 
 *          => 오버로딩 
 *          => 오버라이딩 
 *     6. 다른 클래스와 연동 (클래스 종류) 
 *        추상 클래스 / 인터페이스 / 내부 클래스 
 *     --------------------------------------------
 *     사전에 에러 방지 / 비정상 종료 방지  : 예외처리
 *       => 컴파일 에러 : 반드시 예외처리  
 *       => 실행시 에러 
 *     --------------------------------------------
 *     10장 => java.lang 
 *     11장 => java.util 
 *     ------------------ 컬렉션 / IO / 데이터베이스 
 *                        ----------------------
 *       쓰레드 / 네트워크 : 기본 
 *        
 */
class A
{
	static int a=10;
	static void display()
	{
		int a=20;
		System.out.println(a+a);
	}
}
public class 클래스의구성요소 {
    public static void main(String[] args) {
		A.display();
		A.a=100;
		A aa=new A(); // 100
		A bb=new A(); // 1000
		bb.a=1000;
	}
}
